```
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Reading...
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Read complete after 0s [id=8d232a145587e7e891fc7c3dc13630d472810d21]
module.ecr.data.aws_caller_identity.current: Reading...
module.iam_github_oidc_provider.data.aws_partition.current: Reading...
module.ecr.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.iam_github_oidc_provider.data.aws_partition.current: Read complete after 0s [id=aws]
aws_s3_bucket.tf_state: Refreshing state... [id=paulb-devops-toolkit-terraform-state]
module.ecr.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=905207152945]
data.aws_caller_identity.current: Read complete after 0s [id=905207152945]
aws_s3_bucket_versioning.tf_state: Refreshing state... [id=paulb-devops-toolkit-terraform-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecr_repository_policy.allow_pull_push will be created
  + resource "aws_ecr_repository_policy" "allow_pull_push" {
      + id          = (known after apply)
      + policy      = (known after apply)
      + registry_id = (known after apply)
      + repository  = "devops-toolkit"
    }

  # aws_iam_policy.iam_github_oidc_ecr_access will be created
  + resource "aws_iam_policy" "iam_github_oidc_ecr_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows GitHub OIDC Role to push/pull images from ECR"
      + id               = (known after apply)
      + name             = "GitHubOIDCECRAccess"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Project" = "devops-toolkit"
        }
    }

  # github_repository_file.assume_role_workflow will be created
  + resource "github_repository_file" "assume_role_workflow" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add Assume AWS Role workflow"
      + commit_sha                   = (known after apply)
      + content                      = (known after apply)
      + file                         = ".github/workflows/go-deploy-app.yaml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devops-toolkit"
      + sha                          = (known after apply)
    }

  # module.ecr.data.aws_iam_policy_document.repository[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repository" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetLifecyclePolicy",
              + "ecr:GetLifecyclePolicyPreview",
              + "ecr:GetRepositoryPolicy",
              + "ecr:ListImages",
              + "ecr:ListTagsForResource",
            ]
          + sid     = "PrivateReadOnly"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions = [
              + "ecr:CompleteLayerUpload",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + sid     = "ReadWrite"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.ecr.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "devops-toolkit"
    }

  # module.ecr.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "devops-toolkit"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Project" = "devops-toolkit"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = (known after apply)
      + registry_id = (known after apply)
      + repository  = "devops-toolkit"
    }

  # module.iam_github_oidc_provider.aws_iam_openid_connect_provider.this[0] will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "Project" = "devops-toolkit"
        }
      + thumbprint_list = [
          + "d89e3bd43d5d909b47a18977aa9d5ce36cee184c",
          + "33e4e80807204c2b6182a3a14b591acd25b5f0db",
          + "74f3a68f16524f15424927704c9506f55a9316bd",
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.iam_github_oidc_role.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.iam_github_oidc_role.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
              + "sts:TagSession",
            ]
          + effect  = "Allow"
          + sid     = "GithubOidcAuth"

          + condition {
              + test     = "ForAllValues:StringEquals"
              + values   = [
                  + "https://token.actions.githubusercontent.com",
                ]
              + variable = "token.actions.githubusercontent.com:iss"
            }
          + condition {
              + test     = "ForAllValues:StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:paul-benetis/devops-toolkit:refs/heads/main",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam_github_oidc_role.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.iam_github_oidc_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Project" = "devops-toolkit"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_github_oidc_role.aws_iam_role_policy_attachment.this["ECRPullPush"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->